{
  "title": "Plot",
  "numOptions": "3",
  "items": [
    {
      "text": "assets/images/type/button_pie_chart_empty.svg",
      "alt": "Pie Chart",
      "subHeading": "Pie Chart",
      "vector": true,
      "type": "pie",
      "text1": "assets/images/type/button_pie_chart_fill.svg",
      "text2": "assets/images/type/button_pie_chart_empty.svg"
    },
    {
      "text": "assets/images/type/Updated_bar_chart_empty.svg",
      "alt": "Bar Chart",
      "subHeading": "Bar Chart",
      "vector": true,
      "type": "bar",
      "text1": "assets/images/type/Updated_bar_chart_fill.svg",
      "text2": "assets/images/type/Updated_bar_chart_empty.svg"
    },
    {
      "text": "assets/images/type/button_scatter_plot_empty.svg",
      "alt": "Scatter Plot",
      "subHeading": "Scatter Plot",
      "vector": true,
      "type": "scatter",
      "text1": "assets/images/type/button_scatter_plot_fill.svg",
      "text2": "assets/images/type/button_scatter_plot_empty.svg"
    }
  ],
  "targets": [
    {
      "text": "assets/images/type/Updated_age_neutral.svg",
      "assigned": null,
      "alt": "Age Count",
      "vector": true,
      "original": "age"
    },
    {
      "text": "assets/images/type/Updated_gender_neutral.svg",
      "assigned": null,
      "alt": "Gender Count",
      "vector": true,
      "original": "gender"
    },
    {
      "text": "assets/images/type/Updated_species_neutral.svg",
      "assigned": null,
      "alt": "Species Count",
      "vector": true,
      "original": "species"
    }
  ],
  "targetsNew": [
    {
      "text": " ",
      "assigned": null,
      "alt": null,
      "font": true
    },
    {
      "text": "  ",
      "assigned": null,
      "alt": null,
      "font": true
    },
    {
      "text": "   ",
      "assigned": null,
      "alt": null,
      "font": true
    }
  ],
  "thirdtargets": {
    "age": [
      {
        "text": "assets/images/type/Updated_graph_age_pie_chart.svg",
        "assigned": null,
        "alt": "Pie Chart applied to Age Data Set",
        "vector": true,
        "original": "age",
        "description": "This type of chart is great to visualize what percentage of samples occupy a specific category, in this case, the categories are ages from 1 to 16. When dealing with a large number of categories that have few samples, it might be difficult to read and interpret this graph. When using this type of visualization consider that the main focus is on the percentage of samples within each category, where the percentage is calculated based on the total number of samples."
      },
      {
        "text": "assets/images/type/Updated_graph_age_bar_chart.svg",
        "assigned": null,
        "alt": "Bar Chart applied to Age Data Set",
        "vector": true,
        "original": "age",
        "description":"You have selected a Bar Chart to visualize pet age. This type of chart is great for visualizing the number of samples in each category, in this case, the categories are ages from 1 to 16. From this plot, we can see that a lot of pets are 3 years old or younger. When using this type of visualization consider that the main focus is on the frequency of samples within each category."
      },
      {
        "text": "assets/images/type/Updated_graph_age_scatter_plot.svg",
        "assigned": null,
        "alt": "Scatter Plot applied to Age Data Set",
        "vector": true,
        "original": "age",
        "description": "You have selected a Scatter Plot to visualize pet age. This type of chart is great at showing the relationship between two variables. For example, the relationship between the age of a pet and its weight. This plot can be confusing when comparing a variable against its frequency, such as age against count. When using this type of visualization consider that the main focus is on the relationship between two numerical variables."
      }
    ],
    "gender": [
      {
        "text": "assets/images/type/Updated_graph_gender_pie_chart.svg",
        "assigned": null,
        "alt": "Pie Chart applied to Gender Data Set",
        "vector": true,
        "original": "gender",
        "description": "You have selected a Pie Chart to visualize pet gender. This type of chart is great to visualize what percentage of samples occupy a specific category, in this case, the categories are pet genders male and female. This visualization is great when dealing with a small number of categories, and a large number of samples. This visualization communicates that there are slightly more female pets than male pets in the dataset (51.6% female, 48.4%). When using this type of visualization consider that the main focus is on the percentage of samples within each category, where the percentage is calculated based on the total number of samples."
      },
      {
        "text": "assets/images/type/Updated_graph_gender_bar_chart.svg",
        "assigned": null,
        "alt": "Bar Chart applied to Gender Data Set",
        "vector": true,
        "original": "gender",
        "description": "You have selected a Bar Chart to visualize pet gender. This type of chart is great for visualizing the number of samples in each category, in this case, the categories are pet genders male and female. This type of visualization is useful when the numbers are quite different between the categories. In this example, the number of female and male pets is very close. When using this type of visualization consider that the main focus is on the frequency of samples within each category."
      },
      {
        "text": "assets/images/type/Updated_graph_gender_scatter_plot.svg",
        "assigned": null,
        "alt": "Scatter Plot applied to Gender Data Set",
        "vector": true,
        "original": "gender",
        "description": "You have selected a Scatter Plot to visualize pet gender. This type of chart is great at showing the relationship between two variables. For example, the relationship between the age of a pet and its weight. This plot can be confusing when comparing a variable against its frequency, such as gender against count (the number of times a pet of a given gender appeared in the dataset). When using this type of visualization consider that the main focus is on the relationship between two numerical variables."
      }
    ],
    "species": [
      {
        "text": "assets/images/type/Updated_graph_species_pie_chart.svg",
        "assigned": null,
        "alt": "Pie Chart applied to Species Data Set",
        "vector": true,
        "original": "species",
        "description": "You have selected a Pie Chart to visualize pet species. This type of chart is great to visualize what percentage of samples occupy a specific category. This type of chart emphasizes the idea that almost half of the pets in the dataset are dogs (48.4% of pets are dogs), and that about a third of the pets in the dataset are cats (35.5% of pets are cats). When using this type of visualization consider that the main focus is on the percentage of samples within each category, where the percentage is calculated based on the total number of samples."
      },
      {
        "text": "assets/images/type/Updated_graph_species_bar_chart.svg",
        "assigned": null,
        "alt": "Bar Chart applied to Species Data Set",
        "vector": true,
        "original": "species",
        "description": "You have selected a Bar Chart to visualize pet species. This type of chart is great for visualizing the number of samples in each category, in this case, the categories are pet species. This type of visualization great to see the number of samples within each category. From this plot, we see that most pets in the data set are dogs and cats and that there are 2 lizards, 2 rabbits and 1 tarantula. When using this type of visualization consider that the main focus is on the frequency of samples within each category."
      },
      {
        "text": "assets/images/type/Updated_graph_species_scatter_plot.svg",
        "assigned": null,
        "alt": "Scatter Plot applied to Species Data Set",
        "vector": true,
        "original": "species",
        "description": "You have selected a Scatter Plot to visualize pet species population. This type of chart is great at showing the relationship between two variables. For example, the relationship between the age of a pet and its weight. This plot can be confusing when comparing a variable against its frequency, such as pet species against count (the number of times a pet of a given species appeared in the dataset). When using this type of visualization consider that the main focus is on the relationship between two numerical variables."
      }
    ]
  },
  "options": {
    "ageCount": [
      {
        "text": "assets/images/type/Updated_age_purple.svg",
        "assigned": null,
        "alt": "Age Count with Pie Chart applied",
        "vector": true,
        "original": "age"
      },
      {
        "text": "assets/images/type/Updated_age_blue.svg",
        "assigned": null,
        "alt": "Age Count with Bar Chart applied",
        "vector": true,
        "original": "age"
      },
      {
        "text": "assets/images/type/Updated_age_orange.svg",
        "assigned": null,
        "alt": "Age Count with Scatter Plot applied",
        "vector": true,
        "original": "age"
      }
    ],
    "genderCount": [
      {
        "text": "assets/images/type/Updated_gender_purple.svg",
        "assigned": null,
        "alt": "Gender Count with Pie Chart applied",
        "vector": true,
        "original": "gender"
      },
      {
        "text": "assets/images/type/Updated_gender_blue.svg",
        "assigned": null,
        "alt": "Gender Count with Bar Chart applied",
        "vector": true,
        "original": "gender"
      },
      {
        "text": "assets/images/type/Updated_gender_orange.svg",
        "assigned": null,
        "alt": "Gender Count with Scatter Plot applied",
        "vector": true,
        "original": "gender"
      }
    ],
    "speciesCount": [
      {
        "text": "assets/images/type/Updated_species_purple.svg",
        "assigned": null,
        "alt": "Species Count with Pie Chart applied",
        "vector": true,
        "original": "species"
      },
      {
        "text": "assets/images/type/Updated_species_blue.svg",
        "assigned": null,
        "alt": "Species Count with Bar Chart applied",
        "vector": true,
        "original": "species"
      },
      {
        "text": "assets/images/type/Updated_species_orange.svg",
        "assigned": null,
        "alt": "Species Count with Scatter Plot applied",
        "vector": true,
        "original": "species"
      }
    ]
  },
  "guideDialog": {
    "title": "Data Visualizer",
    "messages": [
      {
        "text": "Choose from the visualization styles (left), then select one of the data sets (right) to apply it and see the result.",
        "url": "assets/images/type/Updated_dialogue_1.svg",
        "alt": "Image of an item being selected and applied to a target."
      },
      {
        "text": "A 'More Info' button will appear when you match a visualization style to a data set.",
        "url": "assets/images/type/Updated_dialogue_2.svg",
        "alt": "Image of the More Info button."
      },
      {
        "text": "Clicking on the 'More Info' button reveals the pros and cons of using this visualization style for the data set.",
        "url": "assets/images/type/Updated_dialogue_3 (2).svg",
        "alt": "Image of the More Info Dialog."
      },
      {
        "text": "Feel free to explore all the different combinations of visualization styles and data sets to see how each result plot compares!",
        "url": "assets/images/type/Updated_dialogue_4 (1).svg",
        "alt": "Image of the options of Data Set that a Visualization Style can be applied to."
      },
      {
        "text": "Use the buttons in the top left to reset the Data Visualizer or view this tutorial again.",
        "url": "assets/images/type/dialogue_4 (1).svg",
        "alt": "Image of the guide and reset button."
      }
    ]
  }
}